========
const, var
========

str :: "hello"
str: string : "hello"

n1 := 10.2
n2: string
n3: f32 = 10e+12
n4: type_of(n3)

---

(source_file
  (const_declaration
    (identifier_list
      (identifier))
    (operator)
    (expression_list
      (interpreted_string_literal)))
  (const_declaration
    (identifier_list
      (identifier))
    (type_identifier)
    (operator)
    (expression_list
      (interpreted_string_literal)))
  (var_declaration
    (identifier_list
      (identifier))
    (operator)
    (expression_list
      (float_literal)))
  (var_declaration
    (identifier_list
      (identifier))
    (type_identifier))
  (var_declaration
    (identifier_list
      (identifier))
    (type_identifier)
    (operator)
    (expression_list
      (float_literal)))
  (var_declaration
    (identifier_list
      (identifier))
    (type_of_expression
      (builtin_identifier)
      (identifier)))
)

========
pointer and array
========

a: ^int = nil
a: [^]int
a: []int
a: [5]int
a: [dynamic]int

---

(source_file
  (var_declaration
    (identifier_list
      (identifier))
    (type_identifier)
    (operator)
    (expression_list
      (nil)))
  (var_declaration
    (identifier_list
      (identifier))
    (type_identifier))
  (var_declaration
    (identifier_list
      (identifier))
    (type_identifier))
  (var_declaration
    (identifier_list
      (identifier))
    (type_fixed_array
      (int_literal)
      (type_identifier)))
  (var_declaration
    (identifier_list
      (identifier))
    (type_dynamic_array
      (keyword)
      (type_identifier)))
)

========
soa
========

a: #soa[]int
a: #soa[5]int
a: #soa[dynamic]int

---

(source_file
  (var_declaration
    (identifier_list
      (identifier))
    (type_soa
      (keyword)
      (type_identifier)))
  (var_declaration
    (identifier_list
      (identifier))
    (type_soa
      (keyword)
      (type_fixed_array
        (int_literal)
        (type_identifier))))
  (var_declaration
    (identifier_list
      (identifier))
    (type_soa
      (keyword)
      (type_dynamic_array
        (keyword)
        (type_identifier))))
)

========
multiple decl
========

a, b: int : 10, 12
a, b, c :: 1, 2, 3

a, b: int
a, b: int = 10, 12
a, b, c := 1, 2, 3

---

(source_file
  (const_declaration
    (identifier_list
      (identifier)
      (identifier))
    (type_identifier)
    (operator)
    (expression_list
      (int_literal)
      (int_literal)))
  (const_declaration
    (identifier_list
      (identifier)
      (identifier)
      (identifier))
    (operator)
    (expression_list
      (int_literal)
      (int_literal)
      (int_literal)))
  (var_declaration
    (identifier_list
      (identifier)
      (identifier))
    (type_identifier))
  (var_declaration
    (identifier_list
      (identifier)
      (identifier))
    (type_identifier)
    (operator)
    (expression_list
      (int_literal)
      (int_literal)))
  (var_declaration
    (identifier_list
      (identifier)
      (identifier)
      (identifier))
    (operator)
    (expression_list
      (int_literal)
      (int_literal)
      (int_literal)))
)
